---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResult.#ctor
source: html/efbf37c3-7c2d-d8d5-e386-0272e55fa5d0.htm
---
# Autodesk.Revit.DB.IntersectionResult.#ctor Method

Initializes a new instance of the IntersectionResult class

## Syntax (C#)
```csharp
public IntersectionResult()
```